sys/243.ejs

<?xml version="1.0" encoding="UTF-8"?>

<s:Envelope
    xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xs="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <wsse:Security>
           <wsse:UsernameToken wsu:Id="SecurityToken-C740D028-8F1D-C45F-E0407C0A04162BDD">
                <wsse:Username><%=username %></wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><%=Password %></wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
     </s:Header>
    <s:Body>
         <SYSSendMessage xmlns="https://sys.sagliknet.saglik.gov.tr/SYS/">
          
      <input>
            &lt;SYSMessage&gt;&#xD;
            &lt;messageGuid value="<%=messageGuid %>" /&gt;
            &lt;messageType version="1" codeSystemGuid="0a9ba485-e7e0-4abb-9c86-0a14fd364bb8" code="243" value="ÖZELLİKLİ İZLEM VERİ SETİ" /&gt;
            &lt;documentGenerationTime value="<%=documentGenerationTime %>" /&gt;
            &lt;author&gt;
            &lt;healthcareProvider version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=healthcareProviderCode %>" value="<%=healthcareProviderValue %>" /&gt;
                &lt;/author&gt;
        &lt;firmaKodu value="<%=firmaKodu %>" /&gt;
            &lt;recordData&gt;
            &lt;OZELLIKLI_IZLEM_BILGILERI&gt;
                   &lt;KACINCI_OZELLIKLI_IZLEM version="1" codeSystemGuid="402e5a45-f723-4309-9cb8-686358dee75a" code="<%=KACINCI_OZELLIKLI_IZLEM.KODU %>" value="<%=KACINCI_OZELLIKLI_IZLEM.ADI %>" /&gt;
                   &lt;LISTEYE_DAHIL_MI version="1" codeSystemGuid="c9d56fee-d143-4602-ad7b-ba131ef92ad9" code="<%=LISTEYE_DAHIL_MI.KODU %>" value="<%=LISTEYE_DAHIL_MI.ADI %>" /&gt;
                   &lt;IZLEM_YAPILMA_DURUMU version="1" codeSystemGuid="c9d56fee-d143-4602-ad7b-ba131ef92ad9" code="<%=IZLEM_YAPILMA_DURUMU.KODU %>" value="<%=IZLEM_YAPILMA_DURUMU.ADI %>" /&gt;
                   &lt;HASTA_KIMLIK_NUMARASI value="<%=HASTA_KIMLIK_NUMARASI %>" /&gt;
                   &lt;IZLEM_TARIHI value="<%=IZLEM_TARIHI %>" /&gt;

                   <%if(IZLEM_YAPILMAMA_NEDENI!=-1){ %>
                    &lt;IZLEM_YAPILMAMA_NEDENI value="<%=IZLEM_YAPILMAMA_NEDENI %>" /&gt;
                   <% }%>

                  
                    &lt;IZLEM_NOTU value="<%=IZLEM_NOTU %>" /&gt;
                    &lt;TELEFON_NUMARASI value="<%=TELEFON_NUMARASI %>" /&gt;
                     
                       <%if(IZLEM_YAPILMAMA_NEDENI_ACIKLAMA!=-1){ %>
                        &lt;IZLEM_YAPILMAMA_NEDENI_ACIKLAMA value="<%=IZLEM_YAPILMAMA_NEDENI_ACIKLAMA %>"  /&gt;
                       <% }%>

                       <%if(SEMPTOM_GELISME_DURUMU!=-1){ %>
                        &lt;SEMPTOM_GELISME_DURUMU version="1" codeSystemGuid="c9d56fee-d143-4602-ad7b-ba131ef92ad9" code="<%=SEMPTOM_GELISME_DURUMU.KODU %>" value="<%=SEMPTOM_GELISME_DURUMU.ADI %>"  /&gt;
                       <% }%>
                       
                       <%if(IZLEM_ISLEM_TURU!=-1){ %>
                        &lt;IZLEM_ISLEM_TURU version="1" codeSystemGuid="5fff8778-89a4-4045-b33e-a7ffe0de0179" code="<%=IZLEM_ISLEM_TURU.KODU %>" value="<%=IZLEM_ISLEM_TURU.ADI %>"   /&gt;
                       <% }%>

                       <%if(ATES_38_6_USTU!=-1){ %>
                        &lt;ATES_38_6_USTU version="1" codeSystemGuid="c9d56fee-d143-4602-ad7b-ba131ef92ad9" code="<%=ATES_38_6_USTU.KODU %>" value="<%=ATES_38_6_USTU.ADI %>"   /&gt;
                       <% }%>

                       <%if(OKSURUK_VAR_MI!=-1){ %>
                        &lt;OKSURUK_VAR_MI version="1" codeSystemGuid="c9d56fee-d143-4602-ad7b-ba131ef92ad9" code="<%=OKSURUK_VAR_MI.KODU %>" value="<%=OKSURUK_VAR_MI.ADI %>"   /&gt;
                       <% }%>
                       <%if(NEFES_DARLIGI_VAR_MI!=-1){ %>
                        &lt;NEFES_DARLIGI_VAR_MI version="1" codeSystemGuid="c9d56fee-d143-4602-ad7b-ba131ef92ad9" code="<%=NEFES_DARLIGI_VAR_MI.KODU %>" value="<%=NEFES_DARLIGI_VAR_MI.ADI %>"   /&gt;
                       <% }%>

                       <%if(NUMUNE_ALINDI_MI!=-1){ %>
                        &lt;NUMUNE_ALINDI_MI version="1" codeSystemGuid="c9d56fee-d143-4602-ad7b-ba131ef92ad9" code="<%=NUMUNE_ALINDI_MI.KODU %>" value="<%=NUMUNE_ALINDI_MI.ADI %>"   /&gt;
                       <% }%>
                       <%if(NUMUNE_ALINMAMA_NEDENI!=-1){ %>
                        &lt;NUMUNE_ALINMAMA_NEDENI value="<%=NUMUNE_ALINMAMA_NEDENI %>"   /&gt;
                       <% }%>
                       <%if(VUCUT_ISISI!=-1){ %>
                        &lt;VUCUT_ISISI value="<%=VUCUT_ISISI %>"   /&gt;
                       <% }%>

                     
            &lt;/OZELLIKLI_IZLEM_BILGILERI&gt;

          
   
                        &lt;/recordData&gt;&#xD;
                        &lt;/SYSMessage&gt;&#xD;
                    </input>
                </SYSSendMessage>
                </s:Body>
        </s:Envelope>                   
                                            
            